// ให้ Declare variable numbers มีค่าเท่ากับ empty array


// ให้เพิ่มข้อมูลลงใน numbers เมื่อแสดงผลลัพธ์บนหน้าจอ จะเห็นข้อมูลดังนี้ [1, 2, 3, 4, 5, 6, 7, 8] 


/* ให้ reassign ข้อมูลใน index ที่ 2 เป็น 15
เมื่อแสดงผลลัพธ์บนหน้าจอ จะเห็นข้อมูลดังนี้ [1, 2, 15, 4, 5, 6, 7, 8]  */


/* ให้เพิ่ม 20 เข้าไปที่ index 0 
เมื่อแสดงผลลัพธ์บนหน้าจอ จะเห็นข้อมูลดังนี้ [20, 1, 2, 15, 4, 5, 6, 7, 8] */


/* ให้เพิ่ม 35 ไปท้ายสุดของ Array 
เมื่อแสดงผลลัพธ์บนหน้าจอ จะเห็นข้อมูลดังนี้ [20, 1, 2, 15, 4, 5, 6, 7, 8, 35] */


/* ให้ลบข้อมูลตัวสุดท้ายใน Array ออก 
เมื่อแสดงผลลัพธ์บนหน้าจอ จะเห็นข้อมูลดังนี้ [20, 1, 2, 15, 4, 5, 6, 7, 8] */


/* ให้ลบข้อมูลตัวแรกสุดใน Array ออก 
เมื่อแสดงผลลัพธ์บนหน้าจอ จะเห็นข้อมูลดังนี้ [1, 2, 15, 4, 5, 6, 7, 8] */


/* ให้หาจำนวนสมาชิกใน Array พร้อมแสดงผลลัพธ์บนหน้าจอ โดยต้องได้ผลลัพธ์ดังนี้ 
"Array นี้มีสมาชิกทั้งหมด 8 ตัว" */